<a href="https://colab.research.google.com/github/crzysab/Python-Pandas/blob/main/Pandas_15.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Memecah nilai string suatu kolom ke dalam beberapa kolom baru pada Pandas Data Frame**

___

Import Module

In [ ]:
import pandas as pd

Persiapan Data Frame

In [ ]:
data = {'nama':['Vidi Aldiano', 'Judika Sihotang', 'Andmesh Kamaleng'],
        'tempat_kelahiran':['Jakarta, DKI Jakarta', 'Sidikalang, Sumatera Utara', 'Alor, NTT']}

df = pd.DataFrame(data)
df

               nama            tempat_kelahiran
0      Vidi Aldiano        Jakarta, DKI Jakarta
1   Judika Sihotang  Sidikalang, Sumatera Utara
2  Andmesh Kamaleng                   Alor, NTT

Memecah Nama Depan dan Nama Belakang

In [ ]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

               nama            tempat_kelahiran nama_depan nama_belakang
0      Vidi Aldiano        Jakarta, DKI Jakarta       Vidi       Aldiano
1   Judika Sihotang  Sidikalang, Sumatera Utara     Judika      Sihotang
2  Andmesh Kamaleng                   Alor, NTT    Andmesh      Kamaleng

Memecah Nama Kota dan Propinsi dari Kolom Tempat Kelahiran

In [ ]:
df[['kota', 'propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

               nama            tempat_kelahiran  ...        kota         propinsi
0      Vidi Aldiano        Jakarta, DKI Jakarta  ...     Jakarta      DKI Jakarta
1   Judika Sihotang  Sidikalang, Sumatera Utara  ...  Sidikalang   Sumatera Utara
2  Andmesh Kamaleng                   Alor, NTT  ...        Alor              NTT

[3 rows x 6 columns]